"""дано масив, довжина якого кратна 3 й закінчується #, треба знайти максимальне, мінімальне й середнє число масиву, а також сумму залишків від ділення кодної трійки на останнє число трійки"""
A=[]
n=0 #довжина масиву
s=0 #сумма масиву +cереднє арефметичне  
t=0 #кратне 3 кожні 3
tree=0 #кінцева сумма при діленні на 3 
max=0
min=100
x=input()
while x != "#":
    x=int(x)
    A.append(x)
    n+=1
    x=input()
for i in range(n):
    if A[i] > max:
        max=A[i]
    if A[i] < min:
        min=A[i]
    s+=A[i]
    if i % 3 == 2:
        t=(A[i]+A[i-1]+A[i-2]) % A[i]
        tree+=t
        t=0
s=s/n
print(round(s,3),max,min,tree)